# ----------------------------------------------------
# 함수(function) 이해 및 활용
# ----------------------------------------------------


# [실습]----------------------------------------------

# ----------------------------------------------------
# 함수기능:   3개의 정수를 덧셈한 결과 반환
# 함수이름:   add3
# 매개변수:   n1,n2,n3
# 함수결과:   정수 result
# ----------------------------------------------------

def add3(n1=0,n2=0,n3=0):
    result = n1+n2+n3
    return result


# ----------------------------------------------------
# 함수기능:   3개의 정수를 곱셈한 결과 반환
# 함수이름:   multi3
# 매개변수:   n1,n2,n3
# 함수결과:   정수 result
# ----------------------------------------------------

def multi3(n1=0,n2=0,n3=0):
    result= n1*n2*n3
    return result


# ----------------------------------------------------
# 함수기능:   2개의 정수를 나눗셈한 결과 출력
# 함수이름:   div
# 매개변수:   n1,n2
# 함수결과:   None
# ----------------------------------------------------

def div(n1,n2):

    if not n2: result ="0으로 나눌 수 없습니다."
    else:   result = n1/n2 

    print(f'{n1}/{n2} => {result}')



## 함수 호출-------------------------------------------

value = add3(1,2,3)

value1 = div(3,4)

print(value1)









