# -------------------------------------------------
# Dict 자료형
# - 여러가지 데이터를 dict 타입으로 저장
# -------------------------------------------------

## [다양한 종류의 키]--------------------------------
## - 키가 여러 개 정보를 합쳐서 사용하는 경우

# 홍길동 1996년생, 홍길동 2000년생
person ={'age':20, ['홍길동', 2000]:100}
'''
TypeError: unhashable type: 'list'

키는 변경 불가능 타입이기 때문에 리스트로 선언 불가능
'''

person ={'age':20, ('홍길동', 2000):100}
print(person)
'''
{'age': 20, ('홍길동', 2000): 100}  
'''

# 4명 정보 저장
p1 = {'name':'홍길동', 'age':20,    'job':'학생'}
p2 = {'name':'마징가', 'age':100,   'job':'영웅'}
p3 = {'name':'배트맨', 'age':98,    'job':'박쥐'}
p4 = {'name':'홍길동', 'age':11,    'job':'학생'}

persons = [p1,p2,p3,p4]
print(persons[0]['name'])

# 유일하게 서로 다른 데이터만을 담은 'age' 를 키로 선언!!

persons2 = {20: {'name':'홍길동','job':'학생'},
            100: {'name':'마징가', 'job':'영웅'},
            98: {'name':'배트맨', 'job':'박쥐'},
            11: {'name':'홍길동', 'job':'학생'} }


# - 키: 이름&나이

persons3 = { ('홍길동',20)  : {'job':'학생'},
             ('마징가',100) : {'job':'영웅'},
             ('배트맨', 98) : {'job':'박쥐'},
             ('홍길동', 11) : {'job':'학생'}}

print( persons3[('홍길동', 11)])
'''
{'job': '학생'}
'''











