# -------------------------------------------------------------
# 제어문 - 반복문과 조건문 혼합
# -------------------------------------------------------------

## [실습]------------------------------------------------------
# 메세지 입력 받기
# 알파벳에 대해 대문자->소문자 소문자->대문자
# 나머지는 그대로 출력

# ord(대문자) + 32 = ord(소문자) !

msg = input().strip()

for m in msg:

    if 'a'<=m<='z':

        # print(f'{m.upper()}',end=" ")
        print(f'{chr(ord(m)-32)}',end=" ")

    elif 'A'<=m<='Z':

        # print(f'{m.lower()}', end=" ")
        print(f'{chr(ord(m)+32)}',end=" ")

    else:
        print(m, end=" ")












