# -------------------------------------------------------------
# 제어문 - while 반복문

# 반복 횟수가 미정일 때!
# -------------------------------------------------------------

num =10

while num>0:

    print(num)
    num-=1         # num 값 갱신

print(num)
'''
10
9
8
7
6
5
4
3
2
1
0
'''

## 실습 -----------------------------------------------------
# 리스트 원소 읽기

# - while 반복문-> 리스트의 인덱스 필요

nums = [11,22,33]

cnt=0
while cnt<len(nums):

    print(nums[cnt])
    cnt+=1


## 실습 -----------------------------------------------------
# "Hello" 문자열 하나씩 출력 w/ while

msg="Hello"

idx=0
while idx<len(msg):
    
    print(msg[idx])
    idx=idx+1











