#-----------------------------------------------------------------
# List data 자료형 살펴보기
# - 원소/요소 변경  -> w.m) 데이터 변경, 삭제
#-----------------------------------------------------------------

datas = [1,3,5,7,9,11]

# 0번 원소 100으로 변경하기
datas[0] = 100
print(datas)

# 0번 원소 삭제
del datas[0]
print(datas)

# 0번 ~ 2번원소를 '삼','오','칠' 변경
# datas=[3, 5, 7, 9, 11]
datas[:3] = ['삼','오','칠']
print(datas)

# 0번 ~ 2번원소를 100 변경
# datas=[3, 5, 7, 9, 11]
datas[:3] = [100]
print(datas)
'''
[100, 9, 11]
'''

# 0번 ~ 2번원소를 22,33,44,55,66,77,88 변경
# datas=[100, 9, 11]
datas[:3] = [22,33,44,55,66,77,88]
print(datas)
'''
[22, 33, 44, 55, 66, 77, 88]
'''

# []로 만들기
# datas=[22, 33, 44, 55, 66, 77, 88]
datas[:] = []
print(datas)
'''
[]
'''






